
## Plan Result

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220328697)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * pagerduty_team.pd_team[&#34;poc&#34;]
  * module.pd_team_association[&#34;imparapoc03@gmail.com&#34;].pagerduty_team_membership.team_membership[&#34;poc&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # pagerduty_team.pd_team["poc"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "poc"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].data.pagerduty_team.team["poc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "pagerduty_team" "team" {
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "poc"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"cf9a0b238d0fb40abbb5fa0ab2c7a307a52b6540","Vars":{},"WorkflowName":"Plan"} -->